const home = {
  htmlShort: `Мова розмітки гіпертексту є стандартною мовою розмітки для
  документи, призначені для відображення у веб-браузері. Це може бути
  за допомогою таких технологій, як каскадні таблиці стилів та
  мови сценаріїв, такі як JavaScript.`,
  nodeShort: `Node.js - это кроссплатформенный сервер с открытым исходным кодом, JavaScript.
  среда выполнения, которая выполняет код JavaScript вне сети
  браузер.`,
  gitShort: `Git - це розподілена система контролю версій для відстеження 
  змін у будь-якому наборі файлів, спочатку призначена для координації роботи між 
  програмістами, які співпрацюють над вихідним кодом під час розробки програмного 
  забезпечення.`,
  cssShort: `Каскадні таблиці стилів - це мова таблиць стилів, яка використовується
  опис викладу документа, написаного з розміткою
  такою мовою, як HTML. CSS є наріжним каменем технології
  Всесвітня павутина, поряд із HTML та JavaScript.`,
  npmShort: `npm - це менеджер пакетів для мови програмування JavaScript.
  npm, Inc. є дочірньою компанією GitHub, американської багатонаціональної компанії
  корпорація, яка надає хостинг для розробки програмного забезпечення та
  контроль версій із використанням Git.`
};
export default home;
