const technologies = {
  css: `Каскадні таблиці стилів (CSS) - це мова таблиць стилів, що використовується для
  опис викладу документа, написаного мовою розмітки
  таких як HTML. [1] CSS - це наріжна технологія світового масштабу
  Інтернет, поряд з HTML та JavaScript. [2] CSS призначений для включення
  розділення презентації та змісту, включаючи макет, кольори та
  шрифти. [3] Це розділення може покращити доступність вмісту, забезпечити
  більша гнучкість та контроль у специфікації презентації
  характеристики, дозволити декільком веб-сторінкам спільно використовувати форматування
  зазначення відповідного CSS в окремому файлі .css, який зменшує
  складність і повторюваність структурного змісту, а також
  включення кешованого файлу .css для покращення швидкості завантаження сторінки
  між сторінками, що ділять файл, та його форматуванням. Розлука
  форматування та змісту також робить можливим представити те саме
  сторінка розмітки в різних стилях для різних методів візуалізації, наприклад
  як на екрані, у друці, голосом (за допомогою мовного браузера або екрана
  читач), а також на тактильних пристроях на основі Брайля. CSS також має правила для
  альтернативне форматування, якщо доступ до вмісту здійснюється на мобільному пристрої. [4]
  Каскадне ім'я походить від зазначеної пріоритетної схеми до
  визначити, яке правило стилю застосовується, якщо більше ніж одне правило відповідає a
  певний елемент. Ця схема каскадного пріоритету передбачувана.
  Специфікації CSS підтримуються Консорціумом World Wide Web
  (W3C). Інтернет-носій (тип MIME) text / css зареєстрований для використання
  з CSS за RFC 2318 (березень 1998). W3C працює з безкоштовним CSS
  служба перевірки документів CSS. [5] Крім HTML, інші
  мови розмітки підтримують використання CSS, включаючи XHTML, звичайний XML,
  SVG та XUL.`,
  git: `Git (/ ɡɪt /) [7] - це розподілена система контролю версій для відстеження
  зміни в будь-якому наборі файлів, спочатку призначених для координації роботи
  серед програмістів, які співпрацюють над вихідним кодом під час програмного забезпечення
  розвитку. [8] Його цілі включають швидкість, цілісність даних та підтримку
  для розподілених, нелінійних робочих процесів [роз'яснення
  потрібно]. [9] [10] [11] Git був створений Лінусом Торвальдсом в 2005 році для
  розробка ядра Linux разом з іншими розробниками ядра
  сприяючи його початковому розвитку. [12] З 2005 року Хуніо Хамано
  був основним супроводжувачем. Як і у більшості інших розподілених
  системи контролю версій, і на відміну від більшості систем клієнт-сервер, кожен
  Каталог Git на кожному комп'ютері - це повноцінне сховище з
  повна історія та можливості повного відстеження версій, незалежно від
  доступ до мережі або центральний сервер. [13] Git є безкоштовним та відкритим
  програмне забезпечення, що поширюється під загальною публічною ліцензією GNU, версія 2.`,
  html: `Мова розмітки гіпертексту (HTML) - це стандартна мова розмітки для
  документи, призначені для відображення у веб-браузері. Це може бути
  за допомогою таких технологій, як каскадні таблиці стилів (CSS) та
  мови сценаріїв, такі як JavaScript. Веб-браузери отримують HTML
  документи з веб-сервера або з локального сховища та відображають
  документи на мультимедійні веб-сторінки. HTML описує структуру a
  веб-сторінка семантично та спочатку включала підказки щодо зовнішнього вигляду
  документа. Елементи HTML - це будівельні блоки HTML-сторінок.
  За допомогою HTML-конструкцій, зображень та інших об’єктів, таких як інтерактивні
  форми можуть бути вбудовані у відтворену сторінку. HTML забезпечує засіб
  створювати структуровані документи, позначаючи структурну семантику тексту
  такі як заголовки, абзаци, списки, посилання, цитати та інші пункти.
  Елементи HTML розмежовані тегами, записаними за допомогою кутових дужок.
  Такі теги, як img та input, безпосередньо вводять вміст на сторінку.
  Інші теги, такі як p surround, містять інформацію про документ
  текст і може включати інші теги як піделементи. Браузери ні
  відображати HTML-теги, але використовувати їх для інтерпретації вмісту
  сторінки. HTML може вбудовувати програми, написані мовою сценаріїв, наприклад
  JavaScript, який впливає на поведінку та зміст веб-сторінок.
  Включення CSS визначає вигляд та макет вмісту. Світ
  Wide Web Consortium (W3C), колишній супровідник HTML і поточний
  , що підтримує стандарти CSS, заохочує використання CSS
  явний презентаційний HTML з 1997 року.`,
  node: `Node.js - це JavaScript із відкритим вихідним кодом, міжплатформеним, бек-ендом
  середовище виконання, яке виконує код JavaScript поза Інтернетом
  браузер. Node.js дозволяє розробникам використовувати JavaScript для написання командного рядка
  інструменти та для сценаріїв на стороні сервера - запуск скриптів на стороні сервера до
  створювати динамічний вміст веб-сторінки до того, як сторінка буде відправлена   користувачеві
  веб-браузер. Отже, Node.js представляє "JavaScript
  скрізь 'парадигма [6], що об'єднує розробку веб-додатків навколо a
  одна мова програмування, а не різні мови для
  сценарії на стороні сервера та клієнта. Хоча .js є стандартом
  розширення імені файлу для коду JavaScript, ім'я 'Node.js' - ні
  посилаються на конкретний файл у цьому контексті, і це просто ім'я
  продукт. Node.js має архітектуру, керовану подіями
  асинхронний ввід / вивід. Ці варіанти дизайну спрямовані на оптимізацію пропускної здатності та
  масштабованість у веб-додатках з багатьма операціями введення / виводу, як
  а також для веб-додатків у режимі реального часу (наприклад, спілкування в реальному часі
  програми та браузерні ігри). [7] Розподілена розробка Node.js
  Раніше проект керувався Фондом Node.js [8] і має
  в даний час об'єднано з Фондом JS, щоб сформувати Фонд OpenJS, який
  сприяють спільні проекти Фонду Linux
  програма. [9] Корпоративні користувачі програмного забезпечення Node.js включають GoDaddy, [10]
  Groupon, [11] IBM, [12] LinkedIn, [13] [14] Microsoft, [15] [16]
  Netflix, [17] PayPal, [18] [19] Rakuten, SAP, [20] Voxer, [21] Walmart, [22]
  Yahoo!, [23] та Amazon Web Services. [24]`,
  vsc: `У програмній інженерії контроль версій (також відомий як перегляд
    управління, управління джерелом або управління вихідним кодом) - це клас
    системи, відповідальні за управління змінами в комп'ютерних програмах,
    документи, великі веб-сайти чи інші колекції інформації.
    Контроль версій є складовою конфігурації програмного забезпечення
    управління. [1] Зміни, як правило, визначаються цифрою або літерою
    код, що називається "номер редакції", "рівень редакції" або просто
    'перегляд'. Наприклад, початковий набір файлів - це "версія 1". Коли
    зроблено першу зміну, отриманий набір - «перегляд 2», і так
    на. Кожна редакція пов’язана з позначкою часу та особою, яка її робить
    зміни. Версії можна порівняти, відновити та з деякими типами
    файлів, об’єднаних. Необхідність логічного способу організації та контролю
    ревізії існували майже стільки ж, скільки існувала писемність, але
    контроль за переглядом став набагато важливішим і складнішим, коли
    почалася ера обчислювальної техніки. Нумерація книжкових видань та
    редакції специфікацій - це приклади, що датуються лише друком
    епохи. На сьогоднішній день найбільш здатний (як і складний) контроль перегляду
    системи - це ті, що використовуються при розробці програмного забезпечення, де працює команда людей
    можуть одночасно вносити зміни в ті самі файли. Контроль версій
    системи (VCS) найчастіше працюють як окремі програми, але
    контроль версій також вбудований у різні типи програмного забезпечення, наприклад
    текстові процесори та електронні таблиці, спільні веб-документи [2] та в
    різні системи управління вмістом, наприклад, історія сторінок Вікіпедії.
    Контроль редагування дозволяє повернути документ у формат
    попередня редакція, що є критично важливим для відстеження редакторів
    редагувати один одного, виправляти помилки та захищати від вандалізму та
    спам у вікі.`
};
export default technologies;
