const home = {
  htmlShort: `Язык разметки гипертекста - стандартный язык разметки для
  документы, предназначенные для отображения в веб-браузере. Это может быть
  с помощью таких технологий, как каскадные таблицы стилей и
  языки сценариев, такие как JavaScript.`,
  nodeShort: `Node.js - это кроссплатформенный сервер с открытым исходным кодом, JavaScript.
  среда выполнения, которая выполняет код JavaScript вне сети
  браузер.`,
  gitShort: `Git - это распределенная система контроля версий для отслеживания изменений 
  в любом наборе файлов, изначально предназначенная для координации работы программистов,
  работающих над исходным кодом во время разработки программного обеспечения.`,
  cssShort: `Каскадные таблицы стилей - это язык таблиц стилей, используемый для
  описание представления документа, написанного в разметке
  язык, такой как HTML. CSS - это краеугольная технология
  Всемирная паутина, наряду с HTML и JavaScript.`,
  npmShort: `npm - это менеджер пакетов для языка программирования JavaScript.
  npm, Inc. является дочерней компанией GitHub, американской транснациональной корпорации.
  корпорация, предоставляющая хостинг для разработки программного обеспечения и
  контроль версий с использованием Git.`
};
export default home;
