const technologies = {
  css: `Каскадные таблицы стилей (CSS) - это язык таблиц стилей, используемый для
  описание представления документа, написанного на языке разметки
  например HTML. [1] CSS - это краеугольная технология во всем мире
  Интернет, наряду с HTML и JavaScript. [2] CSS предназначен для включения
  разделение презентации и контента, включая макет, цвета и
  шрифты. [3] Такое разделение может улучшить доступность контента, обеспечить
  больше гибкости и контроля в спецификации презентации
  характеристики, позволяют нескольким веб-страницам совместно использовать форматирование,
  указание соответствующего CSS в отдельном файле .css, что уменьшает
  сложность и повторяемость структурного содержания, а также
  включение кэширования файла .css для повышения скорости загрузки страницы
  между страницами, которые совместно используют файл, и его форматированием. Разделение
  форматирования и содержания также позволяет представить одинаковые
  страницу разметки в разных стилях для разных методов рендеринга, например
  как на экране, в печати, голосом (через речевой браузер или экран
  ридер) и на тактильных устройствах на основе Брайля. В CSS также есть правила для
  альтернативное форматирование, если доступ к контенту осуществляется на мобильном устройстве. [4]
  Каскадирование имен происходит от указанной схемы приоритета к
  определить, какое правило стиля применяется, если более одного правила соответствует одному
  конкретный элемент. Эта каскадная схема приоритетов предсказуема. В
  Спецификации CSS поддерживаются Консорциумом World Wide Web.
  (W3C). Тип интернет-носителя (тип MIME) text / css зарегистрирован для использования
  с CSS по RFC 2318 (март 1998 г.). W3C использует бесплатный CSS
  служба проверки документов CSS. [5] Помимо HTML, другие
  языки разметки поддерживают использование CSS, включая XHTML, простой XML,
  SVG и XUL.`,
  git: `Git (/ ɡɪt /) [7] - это распределенная система контроля версий для отслеживания
  изменения в любом наборе файлов, изначально предназначенных для координации работы
  среди программистов, работающих над исходным кодом во время разработки программного обеспечения
  развитие. [8] Его цели включают скорость, целостность данных и поддержку.
  для распределенных нелинейных рабочих процессов [пояснение
  необходимо]. [9] [10] [11] Git был создан Линусом Торвальдсом в 2005 году для
  разработка ядра Linux с другими разработчиками ядра
  способствуя его первоначальному развитию. [12] С 2005 года Хунио Хамано
  был основным сопровождающим. Как и в большинстве других распространенных
  системы контроля версий, и, в отличие от большинства клиент-серверных систем, каждая
  Каталог Git на каждом компьютере представляет собой полноценный репозиторий с
  полная история и возможность полного отслеживания версий, независимо от
  доступ к сети или центральный сервер. [13] Git бесплатный и с открытым исходным кодом
  программное обеспечение, распространяемое под лицензией GNU General Public License версии 2.`,
  html: `Язык гипертекстовой разметки (HTML) - это стандартный язык разметки для
  документы, предназначенные для отображения в веб-браузере. Это может быть
  с помощью таких технологий, как каскадные таблицы стилей (CSS) и
  языки сценариев, такие как JavaScript. Веб-браузеры получают HTML
  документы с веб-сервера или из локального хранилища и отображать
  документы в мультимедийные веб-страницы. HTML описывает структуру
  веб-страница семантически и изначально включала подсказки для внешнего вида
  документа. Элементы HTML - это строительные блоки HTML-страниц.
  С конструкциями HTML, изображениями и другими объектами, такими как интерактивные
  формы могут быть встроены в отображаемую страницу. HTML предоставляет средства для
  создавать структурированные документы, определяя структурную семантику текста
  такие как заголовки, абзацы, списки, ссылки, цитаты и другие элементы.
  Элементы HTML выделяются тегами, записанными с использованием угловых скобок.
  Такие теги, как img и input, напрямую вводят контент на страницу.
  Другие теги, такие как p, окружают и предоставляют информацию о документе.
  текст и может включать другие теги в качестве подэлементов. Браузеры не
  отображать HTML-теги, но использовать их для интерпретации содержимого
  страница. HTML может встраивать программы, написанные на языке сценариев, например
  JavaScript, который влияет на поведение и содержимое веб-страниц.
  Включение CSS определяет внешний вид и макет контента. Мир
  Консорциум Wide Web (W3C), бывший разработчик HTML и нынешний
  поддерживающий стандарты CSS, поощрял использование CSS вместо
  явный презентационный HTML с 1997 года.`,
  node: `Node.js - это кроссплатформенный сервер с открытым исходным кодом, JavaScript.
  среда выполнения, которая выполняет код JavaScript вне сети
  браузер. Node.js позволяет разработчикам использовать JavaScript для написания командной строки
  инструменты и для сценариев на стороне сервера - выполнение сценариев на стороне сервера для
  создавать динамическое содержимое веб-страницы до того, как страница будет отправлена   пользователю
  веб-браузер. Следовательно, Node.js представляет собой 'JavaScript
  повсюду », [6] объединяющая разработку веб-приложений вокруг
  единый язык программирования, а не разные языки для
  серверные и клиентские скрипты. Хотя .js - это стандарт
  расширение имени файла для кода JavaScript, имя "Node.js" не
  относится к конкретному файлу в этом контексте и является просто именем
  продукт. Node.js имеет управляемую событиями архитектуру, способную
  асинхронный ввод-вывод. Эти варианты дизайна направлены на оптимизацию пропускной способности и
  масштабируемость в веб-приложениях с множеством операций ввода / вывода, как
  а также для веб-приложений в реальном времени (например, связь в реальном времени
  программы и браузерные игры). [7] Распределенная разработка на Node.js
  проект ранее управлялся Node.js Foundation, [8] и имеет
  теперь объединен с JS Foundation, чтобы сформировать OpenJS Foundation, который
  поддерживается совместными проектами Linux Foundation
  программа. [9] Корпоративные пользователи программного обеспечения Node.js включают GoDaddy, [10]
  Groupon, [11] IBM, [12] LinkedIn, [13] [14] Microsoft, [15] [16]
  Netflix, [17] PayPal, [18] [19] Rakuten, SAP, [20] Voxer, [21] Walmart, [22]
  Yahoo !, [23] и Amazon Web Services. [24]`,
  npm: `Менеджер пакетов или система управления пакетами - это набор
  программные инструменты, автоматизирующие процесс установки, обновления,
  настройка и удаление компьютерных программ для работы на компьютере
  систему согласованным образом. [1] Менеджер пакетов занимается
  пакеты, дистрибутивы программного обеспечения и данные в архивных файлах.
  Пакеты содержат метаданные, такие как название программного обеспечения, описание
  его назначение, номер версии, поставщик, контрольная сумма (желательно
  криптографическая хеш-функция) и список зависимостей, необходимых для
  программное обеспечение для правильной работы. После установки метаданные хранятся в
  локальная база данных пакетов. Менеджеры пакетов обычно поддерживают
  база данных программных зависимостей и информации о версии для предотвращения
  несоответствие программного обеспечения и отсутствие предварительных условий. Они тесно сотрудничают с
  программные репозитории, менеджеры двоичных репозиториев и магазины приложений.
  Менеджеры пакетов разработаны таким образом, чтобы исключить необходимость в ручном
  устанавливает и обновляет. Это может быть особенно полезно для больших
  предприятия, операционные системы которых обычно состоят из
  сотни или даже десятки тысяч различных программных пакетов [2].
  Npm (первоначально сокращение от Node Package Manager) [4] - это пакет
  менеджер для языка программирования JavaScript. npm, Inc. является
  дочерняя компания GitHub, американской транснациональной корпорации, которая
  предоставляет хостинг для разработки программного обеспечения и контроля версий с
  использование Git. Это менеджер пакетов по умолчанию для JavaScript.
  среда выполнения Node.js. Он состоит из клиента командной строки,
  также называемый npm, и онлайн-база данных общедоступных и оплачиваемых частных
  пакеты, называемые реестром npm. Доступ к реестру осуществляется через
  клиент, а доступные пакеты можно просматривать и искать через
  веб-сайт npm. Менеджером пакетов и реестром управляет npm,
  Inc.`,
  vsc: `В разработке программного обеспечения контроль версий (также известный как пересмотр
    контроль, управление исходным кодом или управление исходным кодом) - это класс
    системы, отвечающие за управление изменениями в компьютерных программах,
    документы, большие веб-сайты или другие сборники информации.
    Контроль версий - это компонент конфигурации программного обеспечения.
    управление. [1] Изменения обычно обозначаются цифрой или буквой.
    код, называемый "номер редакции", "уровень редакции" или просто
    «пересмотр». Например, начальный набор файлов - «редакция 1». Когда
    первое изменение сделано, результирующим набором будет "версия 2", и поэтому
    на. Каждая ревизия связана с меткой времени и лицом, вносящим
    изменение. Редакции можно сравнивать, восстанавливать и с некоторыми типами
    файлов, объединенных. Потребность в логическом способе организации и контроля
    исправления существуют почти столько же, сколько существует письменность, но
    контроль версий стал намного более важным и сложным, когда
    началась эра вычислительной техники. Нумерация книжных изданий и
    изменения спецификации являются примерами, которые относятся к версии только для печати.
    эпоха. На сегодняшний день самый эффективный (а также сложный) контроль версий
    системы - это те, которые используются при разработке программного обеспечения, где команда людей
    может одновременно вносить изменения в одни и те же файлы. Управление версиями
    системы (VCS) чаще всего запускаются как автономные приложения, но
    контроль версий также встроен в различные типы программного обеспечения, например
    текстовые редакторы и электронные таблицы, совместные веб-документы [2] и в
    различные системы управления контентом, например, история страниц Википедии.
    Контроль версий позволяет вернуть документ в
    предыдущая версия, которая имеет решающее значение для того, чтобы редакторы могли отслеживать
    редактировать друг друга, исправлять ошибки и защищаться от вандализма и
    рассылка спама в вики.`
};
export default technologies;
